post/app/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "GPG Key"], ["description", "How to create a GPG Key on Tails Linux"], ["created_at", "2020-11-10 10:02:55.343953"], ["updated_at", "2020-11-10 10:02:55.343953"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]
---
  def destroy
    if @post
      @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find(params[:id])